public/programming/gists/c/set_signals.c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org07ed715" class="outline-2">
<h2 id="org07ed715">C / set_signals.c</h2>
<div class="outline-text-2" id="text-org07ed715">
<p>
Setup an handler for various POSIX signals.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #989898;">// </span><span style="color: #989898;">SPDX-License-Identifier: MIT
</span><span style="color: #989898;">// </span><span style="color: #989898;">Author: Giovanni Santini
</span><span style="color: #989898;">// </span><span style="color: #989898;">Github: @San7o
</span>
<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">_POSIX_SOURCE</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;signal.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;stddef.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;stdio.h&gt;</span>

<span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">sig_shutdown_handler</span>(<span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">signum</span>)
{
  (<span style="color: #6ae4b9;">void</span>) signum;

  <span style="color: #989898;">// </span><span style="color: #989898;">...
</span>
  <span style="color: #b6a0ff;">return</span>;
}

<span style="color: #989898;">// </span><span style="color: #989898;">Setup SIGINT, SIGTERM and SIGQUIT
</span><span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">set_signals</span>(<span style="color: #6ae4b9;">void</span>)
{
  <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">sigaction</span> <span style="color: #00d3d0;">act</span>;
  act.sa_handler = sig_shutdown_handler;
  act.sa_flags = 0;
  sigemptyset(&amp;act.sa_mask);
  <span style="color: #b6a0ff;">if</span> (sigaction(SIGINT, &amp;act, <span style="color: #00bcff;">NULL</span>) == -1)  <span style="color: #989898;">// </span><span style="color: #989898;">Ctrl+C
</span>  {
    perror(<span style="color: #79a8ff;">"Error setting SIGINT"</span>);
    <span style="color: #b6a0ff;">return</span> 1;
  }
  <span style="color: #b6a0ff;">if</span> (sigaction(SIGTERM, &amp;act, <span style="color: #00bcff;">NULL</span>) == -1) <span style="color: #989898;">// </span><span style="color: #989898;">hard shutdown
</span>  {
    perror(<span style="color: #79a8ff;">"Error setting SIGTERM"</span>);
    <span style="color: #b6a0ff;">return</span> 1;
  }
  <span style="color: #b6a0ff;">if</span> (sigaction(SIGQUIT, &amp;act, <span style="color: #00bcff;">NULL</span>) == -1) <span style="color: #989898;">// </span><span style="color: #989898;">hard shutdown
</span>  {
    perror(<span style="color: #79a8ff;">"Error setting SIGQUIT"</span>);
    <span style="color: #b6a0ff;">return</span> 1;
  }
  <span style="color: #b6a0ff;">return</span> 0;
}
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
